package basic_;

/*网站即软件   http://www.ruanyifeng.com/blog/2011/09/restful.html
*
*REST,即Representational State Transfer的缩写,表现层状态转化
*
* 总结一下什么是RESTful架构：
　　（1）每一个URI代表一种资源；
　　（2）客户端和服务器之间，传递这种资源的某种表现层；
　　（3）客户端通过四个HTTP动词，对服务器端资源进行操作，实现"表现层状态转化"。

"资源"表示一种实体，所以应该是名词，URI不应该有动词

* "表现层"其实指的是"资源"（Resources）的"表现层",
* 所谓"资源"，就是网络上的一个实体，或者说是网络上的一个具体信息。
*
*
* 问一个网站，就代表了客户端和服务器的一个互动过程。在这个过程中，势必涉及到数据和状态的变化。
互联网通信协议HTTP协议，是一个无状态协议。这意味着，所有的状态都保存在服务器端。因此，如果客户端想要操作服务器，必须通过某种手段，让服务器端发生"状态转化"（State Transfer）。而这种转化是建立在表现层之上的，所以就是"表现层状态转化"。
客户端用到的手段，只能是HTTP协议。具体来说，就是HTTP协议里面，四个表示操作方式的动词：GET、POST、PUT、DELETE。它们分别对应四种基本操作：GET用来获取资源，POST用来新建资源（也可以用于更新资源），PUT用来更新资源，DELETE用来删除资源。
* */











public class RESTful_framework {



}
